Revit 2027 API
ViewSchedule.GetDefaultNameForSchedule Method
Overload List
Name | Description
GetDefaultNameForSchedule(Document, ElementId) |  Gets the default view name that will be used when creating a regular schedule.
GetDefaultNameForSchedule(Document, ElementId, ElementId) |  Gets the default view name that will be used when creating a schedule.
Top
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace